OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/incompressible/pimpleFoam/laminar/cylinder2D/system/DMDs/stdmd02
// -*- C++ -*-

stdmd02
{
    ${stdmd01}

    region          coarseMesh;
}


// ************************************************************************* //
