OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/incompressible/pimpleFoam/laminar/cylinder2D/system/DMDs/stdmd48
// -*- C++ -*-

stdmd48
{
    ${stdmd01}

    field            UPrime2Mean;
    maxRank          5;
    region           coarseMesh;
}


// ************************************************************************* //
