OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/incompressible/pimpleFoam/laminar/cylinder2D/system/DMDs/stdmd61
// -*- C++ -*-

stdmd61
{
    ${stdmd01}

    field            yPlus;
    patch            cylinder;
    maxRank          2;
}


// ************************************************************************* //
